pams_verify/experiments/01_dense_baselines/raw/live_dense_no_spec/vllm_bench_serve.log
INFO 05-23 11:46:00 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 05-23 11:46:00 [nixl_utils.py:34] NIXL is not available
WARNING 05-23 11:46:00 [nixl_utils.py:44] NIXL agent config is not available
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75db59758540>, trust_remote_code=True, seed=0, num_prompts=4, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=64, random_output_len=16, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8030', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=1, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/ACALAB/stu1/chenruiyang/Code/LLM/SpecLink/speculators/pams_verify/experiments/01_dense_baselines/raw/live_dense_no_spec', result_filename='dense_no_spec.json', ignore_eos=False, percentile_metrics='ttft,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-f389d963-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-23 11:46:05 [utils.py:90] Sampling input_len from [64, 64] and output_len from [16, 16]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     4         
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  0.76      
Total input tokens:                      288       
Total generated tokens:                  64        
Request throughput (req/s):              5.29      
Output token throughput (tok/s):         84.62     
Peak output token throughput (tok/s):    68.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          465.41    
---------------Time to First Token----------------
Mean TTFT (ms):                          19.75     
Median TTFT (ms):                        20.08     
P50 TTFT (ms):                           20.08     
P95 TTFT (ms):                           20.15     
P99 TTFT (ms):                           20.15     
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.58     
Median ITL (ms):                         11.26     
P50 ITL (ms):                            11.26     
P95 ITL (ms):                            11.56     
P99 ITL (ms):                            11.63     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          189.01    
Median E2EL (ms):                        189.32    
P50 E2EL (ms):                           189.32    
P95 E2EL (ms):                           189.59    
P99 E2EL (ms):                           189.60    
==================================================